#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
google_compute_network.vpc: Refreshing state... [id=projects/sandbox-environment-338017/global/networks/sandbox-environment-338017-vpc]
google_compute_subnetwork.subnet: Refreshing state... [id=projects/sandbox-environment-338017/regions/us-central1/subnetworks/sandbox-environment-338017-subnet]
google_container_cluster.primary: Refreshing state... [id=projects/sandbox-environment-338017/locations/us-central1/clusters/sandbox-environment-338017-gke]
google_container_node_pool.primary_nodes: Refreshing state... [id=projects/sandbox-environment-338017/locations/us-central1/clusters/sandbox-environment-338017-gke/nodePools/sandbox-environment-338017-gke-node-pool]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_container_cluster.primary has been deleted
  - resource "google_container_cluster" "primary" {
      - cluster_ipv4_cidr           = "10.68.0.0/14" -> null
      - enable_autopilot            = false -> null
      - enable_binary_authorization = false -> null
      - enable_intranode_visibility = false -> null
      - enable_kubernetes_alpha     = false -> null
      - enable_legacy_abac          = false -> null
      - enable_shielded_nodes       = true -> null
      - enable_tpu                  = false -> null
      - endpoint                    = "34.132.209.8" -> null
      - id                          = "projects/sandbox-environment-338017/locations/us-central1/clusters/sandbox-environment-338017-gke" -> null
      - initial_node_count          = 1 -> null
      - label_fingerprint           = "a9dc16a7" -> null
      - location                    = "us-central1" -> null
      - logging_service             = "logging.googleapis.com/kubernetes" -> null
      - master_version              = "1.21.6-gke.1500" -> null
      - monitoring_service          = "monitoring.googleapis.com/kubernetes" -> null
      - name                        = "sandbox-environment-338017-gke" -> null
      - network                     = "projects/sandbox-environment-338017/global/networks/sandbox-environment-338017-vpc" -> null
      - networking_mode             = "ROUTES" -> null
      - node_locations              = [
          - "us-central1-a",
          - "us-central1-b",
          - "us-central1-f",
        ] -> null
      - node_version                = "1.21.6-gke.1500" -> null
      - project                     = "sandbox-environment-338017" -> null
      - remove_default_node_pool    = true -> null
      - self_link                   = "https://container.googleapis.com/v1/projects/sandbox-environment-338017/locations/us-central1/clusters/sandbox-environment-338017-gke" -> null
      - services_ipv4_cidr          = "10.71.240.0/20" -> null
      - subnetwork                  = "projects/sandbox-environment-338017/regions/us-central1/subnetworks/sandbox-environment-338017-subnet" -> null

      - addons_config {

          - network_policy_config {
              - disabled = true -> null
            }
        }

      - cluster_autoscaling {
          - enabled = false -> null
        }

      - database_encryption {
          - state = "DECRYPTED" -> null
        }

      - default_snat_status {
          - disabled = false -> null
        }

      - logging_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> null
        }

      - master_auth {
          - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMVENDQXBXZ0F3SUJBZ0lSQVBycVlQOUhBM2xwWHZhOVMrelJ4WDh3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa056STBORFV6TXpBdFl6STVaQzAwTldNeUxXSXdNV1l0TXpCa09UZzROV014WmpGawpNQ0FYRFRJeU1ESXlNekE0TXprek9Gb1lEekl3TlRJd01qRTJNRGt6T1RNNFdqQXZNUzB3S3dZRFZRUURFeVEzCk1qUTBOVE16TUMxak1qbGtMVFExWXpJdFlqQXhaaTB6TUdRNU9EZzFZekZtTVdRd2dnR2lNQTBHQ1NxR1NJYjMKRFFFQkFRVUFBNElCandBd2dnR0tBb0lCZ1FDVVBCWmJkd2F0VWIvT1dKd0RGM04yNFpoVW9uaEpyV3h3bkM4ZQpCcjh0Zy9Dd25taTVEbE1MVGVBeW9XdXYzMGc1QUpWK0V3UCtNU08vUGs5ZnJBTWgyclQ3NXZEdG5kTERKQXlZClNpNDY0dkR3azJBNlVPeDdrdktMZXNqZ2dmQnFVQ2IxdFEzMjVnSHZzQlRTVzhUWDhkVnlUOWRQSmpsY0pGUFQKait4UHU5ekk5OGgzejFRVVBHR2V1dmJsYU9DMXNSZEJSNlZ3UElkR1MrUDFRdXI5N3gyQ3hhNkdnTHdyMEJ6TAo4eG5DcHFEcUgzVysrNVR5UXNsU3lUbE9hN3ZmSFlXaFowS1lMb0dXMElwdWZwbm10RTdua09JNVVPRzUyQjhmCnR6b1pHUjNnWDB3SlZzNkhuRXVkaTlhM3hmYmxQM3Q1bXVPY1R5Z09nRy9kLzN3Z0RPbVFmQmpOeDVudzlyS1gKRHUwUTNmTEpYNVRUWFF6b3pXa2NrWm1ueFF2c01GN3hpcUpJL1V5U0FqemUrTzUveWdyVFd6UFR6b2NpdGhLZwpkdnlwbTBzRTY3cjNSdlNlRVY4SXA1ckwrTGpQRERZNFpJTTZmamlHWHFtcjlOakphTCtxcHJIclNyWjZHeUpFCnpzNFVwczRuTUsrS2ZKbXdENkJ3Z0lJcWplY0NBd0VBQWFOQ01FQXdEZ1lEVlIwUEFRSC9CQVFEQWdJRU1BOEcKQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGRDBpd0ljeE9xemFUTmtPTEQ2eVBObEFNT0JNTUEwRwpDU3FHU0liM0RRRUJDd1VBQTRJQmdRQ1VBYVMzNjJRS1FGMWgzRVpaV1RsUlprU1dsRVZFaDdQV2FZRDFxVXh2CkJyb3orY0J6dzVqaFpPalhzNmF2VDRUYXl2TkdEckJpOUN0dHhXVkFDM2JIUm5PbXBvMkw0T0tVZUZENU52YUMKZnVDTTQrYjVvdWxwZ01DOVQwMGFiUWhFU04xRGkrK2NmU3JYZmNtTUtyQkRYYyt0cVgyQmNFSmVubTduNk0ycwo3SEpiU0gzeVR2NEg4N2xINURHUXdsSlhrazRaWFkxZi9vcGxtUUR0ZGR2SzVSK2pSalk5UnovdGt4SmpkNTB0CklWNTR1YXRHRUQxT0RCZnVyMXF5SVJCc2FHS0hWZmVyWEdQWDMrRFZLL1ZZK0RPN0p3OTFnWDhtTzlzbmNKT0gKYWVwR1lYN3NublcveXk2aFNyQ1NISU5WOWlBSFg5TE1lQlBlSjNVdFFKRWxVaGQ2c0t5UDdKV1ErM0Z0NE9UZgozL2R0WVBQUkh0WGdjWFZITmtGU2FEcVVha3FLWGRJYXF1dlg3RmRTMmw0QzM4NGpmMFZEbVlpNFM2bnp6R1ZUClVCZHJFWCtTYVlTMVdpUjdsem1mSzZhaHFVOEpCalJCZFo5dlBERFNIbi8yUmwvTmZZTlozc0N4Um4rZGNhMUkKaWJXb3ZSSUtvZlZyRWE4enVNV2Q2Q1E9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> null

          - client_certificate_config {
              - issue_client_certificate = false -> null
            }
        }

      - monitoring_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
            ] -> null
        }

      - network_policy {
          - enabled  = false -> null
          - provider = "PROVIDER_UNSPECIFIED" -> null
        }

      - release_channel {
          - channel = "REGULAR" -> null
        }
    }

  # google_container_node_pool.primary_nodes has been deleted
  - resource "google_container_node_pool" "primary_nodes" {
      - cluster        = "sandbox-environment-338017-gke" -> null
      - id             = "projects/sandbox-environment-338017/locations/us-central1/clusters/sandbox-environment-338017-gke/nodePools/sandbox-environment-338017-gke-node-pool" -> null
      - location       = "us-central1" -> null
      - name           = "sandbox-environment-338017-gke-node-pool" -> null
      - node_count     = 2 -> null
      - node_locations = [] -> null

      - node_config {
          - disk_size_gb      = 0 -> null
          - guest_accelerator = [] -> null
          - labels            = {
              - "env" = "sandbox-environment-338017"
            } -> null
          - local_ssd_count   = 0 -> null
          - machine_type      = "n1-standard-1" -> null
          - metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> null
          - oauth_scopes      = [
              - "https://www.googleapis.com/auth/logging.write",
              - "https://www.googleapis.com/auth/monitoring",
            ] -> null
          - preemptible       = false -> null
          - tags              = [
              - "gke-node",
              - "sandbox-environment-338017-gke",
            ] -> null
          - taint             = [] -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_subnetwork.subnet must be replaced
-/+ resource "google_compute_subnetwork" "subnet" {
      ~ creation_timestamp         = "2022-02-23T01:39:16.694-08:00" -> (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      ~ gateway_address            = "10.10.0.1" -> (known after apply)
      ~ id                         = "projects/sandbox-environment-338017/regions/us-central1/subnetworks/sandbox-environment-338017-subnet" -> (known after apply)
      + ipv6_cidr_range            = (known after apply)
        name                       = "sandbox-environment-338017-subnet"
      ~ network                    = "https://www.googleapis.com/compute/v1/projects/sandbox-environment-338017/global/networks/sandbox-environment-338017-vpc" -> "sandbox-environment-338017-vpc"
      - private_ip_google_access   = false -> null
      ~ private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> (known after apply)
      ~ project                    = "sandbox-environment-338017" -> (known after apply)
      ~ purpose                    = "PRIVATE" -> (known after apply)
      ~ region                     = "us-central1" -> "us-east1" # forces replacement
      ~ secondary_ip_range         = [] -> (known after apply)
      ~ self_link                  = "https://www.googleapis.com/compute/v1/projects/sandbox-environment-338017/regions/us-central1/subnetworks/sandbox-environment-338017-subnet" -> (known after apply)
      ~ stack_type                 = "IPV4_ONLY" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "us-east1"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "sandbox-environment-338017-gke"
      + network                     = "sandbox-environment-338017-vpc"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = (known after apply)
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "sandbox-environment-338017-subnet"
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled           = (known after apply)
              + load_balancer_type = (known after apply)
            }

          + gcp_filestore_csi_driver_config {
              + enabled = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = (known after apply)
            }

          + http_load_balancing {
              + disabled = (known after apply)
            }

          + network_policy_config {
              + disabled = (known after apply)
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      + cluster_autoscaling {
          + enabled = (known after apply)

          + auto_provisioning_defaults {
              + image_type      = (known after apply)
              + oauth_scopes    = (known after apply)
              + service_account = (known after apply)
            }

          + resource_limits {
              + maximum       = (known after apply)
              + minimum       = (known after apply)
              + resource_type = (known after apply)
            }
        }

      + confidential_nodes {
          + enabled = (known after apply)
        }

      + database_encryption {
          + key_name = (known after apply)
          + state    = (known after apply)
        }

      + default_snat_status {
          + disabled = (known after apply)
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = (known after apply)
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = (known after apply)
        }

      + logging_config {
          + enable_components = (known after apply)
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = (known after apply)
            }
        }

      + monitoring_config {
          + enable_components = (known after apply)
        }

      + network_policy {
          + enabled  = (known after apply)
          + provider = (known after apply)
        }

      + node_config {
          + boot_disk_kms_key = (known after apply)
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + node_group        = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = (known after apply)
          + service_account   = (known after apply)
          + tags              = (known after apply)
          + taint             = (known after apply)

          + gcfs_config {
              + enabled = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count          = (known after apply)
          + instance_group_urls         = (known after apply)
          + managed_instance_group_urls = (known after apply)
          + max_pods_per_node           = (known after apply)
          + name                        = (known after apply)
          + name_prefix                 = (known after apply)
          + node_count                  = (known after apply)
          + node_locations              = (known after apply)
          + version                     = (known after apply)

          + autoscaling {
              + max_node_count = (known after apply)
              + min_node_count = (known after apply)
            }

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + node_config {
              + boot_disk_kms_key = (known after apply)
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = (known after apply)
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = (known after apply)
              + metadata          = (known after apply)
              + min_cpu_platform  = (known after apply)
              + node_group        = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = (known after apply)
              + service_account   = (known after apply)
              + tags              = (known after apply)
              + taint             = (known after apply)

              + gcfs_config {
                  + enabled = (known after apply)
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + workload_metadata_config {
                  + mode = (known after apply)
                }
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

      + release_channel {
          + channel = (known after apply)
        }

      + workload_identity_config {
          + workload_pool = (known after apply)
        }
    }

  # google_container_node_pool.primary_nodes will be created
  + resource "google_container_node_pool" "primary_nodes" {
      + cluster                     = "sandbox-environment-338017-gke"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-east1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "sandbox-environment-338017-gke-node-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = 2
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + management {
          + auto_repair  = (known after apply)
          + auto_upgrade = (known after apply)
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "env" = "sandbox-environment-338017"
            }
          + local_ssd_count   = (known after apply)
          + machine_type      = "n1-standard-1"
          + metadata          = {
              + "disable-legacy-endpoints" = "true"
            }
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + tags              = [
              + "gke-node",
              + "sandbox-environment-338017-gke",
            ]
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @roopeshvs, Action: `pull_request`*